In [ ]:
#!pip install sqlalchemy==1.3.9

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [2]:
%load_ext sql

In [3]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [5]:
%sql sqlite:///my_data1.db

'Connected: @my_data1.db'

In [6]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

/usr/local/lib/python3.7/dist-packages/pandas/core/generic.py:2882: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  both result in 0.1234 being formatted as 0.12.

## Tasks

### Task 1

##### Display the names of the unique launch sites  in the space mission

In [7]:
%sql SELECT DISTINCT LAUNCH_SITE FROM SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]

### Task 2

##### Display 5 records where launch sites begin with the string 'CCA'

In [8]:
%%sql 
SELECT LAUNCH_SITE 
FROM SPACEXTBL
WHERE LAUNCH_SITE LIKE 'CCA%'
LIMIT 5

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',)]

### Task 3

##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [9]:
%%sql
SELECT SUM(PAYLOAD_MASS__KG_) AS Total_payload_mass, CUSTOMER
FROM SPACEXTBL
WHERE CUSTOMER = 'NASA (CRS)'
GROUP BY CUSTOMER

 * sqlite:///my_data1.db
Done.

[(45596, 'NASA (CRS)')]

### Task 4

##### Display average payload mass carried by booster version F9 v1.1

In [10]:
%%sql
SELECT AVG(PAYLOAD_MASS__KG_) AS Average_payload_mass, BOOSTER_VERSION
FROM SPACEXTBL
WHERE BOOSTER_VERSION = 'F9 v1.1'
GROUP BY BOOSTER_VERSION

 * sqlite:///my_data1.db
Done.

[(2928.4, 'F9 v1.1')]

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.

*Hint:Use min function*

In [11]:
%%sql
SELECT MIN(DATE), "Landing _Outcome"
FROM SPACEXTBL
WHERE "Landing _Outcome" = 'Success (ground pad)'

 * sqlite:///my_data1.db
Done.

[('01-05-2017', 'Success (ground pad)')]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [12]:
%%sql
SELECT DISTINCT PAYLOAD, MISSION_OUTCOME
FROM SPACEXTBL
WHERE MISSION_OUTCOME = 'Success'
AND PAYLOAD_MASS__KG_ BETWEEN 4000 AND 6000

 * sqlite:///my_data1.db
Done.

[('AsiaSat 8', 'Success'),
 ('AsiaSat 6', 'Success'),
 ('ABS-3A Eutelsat 115 West B', 'Success'),
 ('Turkmen 52 / MonacoSAT', 'Success'),
 ('SES-9', 'Success'),
 ('JCSAT-14', 'Success'),
 ('JCSAT-16', 'Success'),
 ('EchoStar 23', 'Success'),
 ('SES-10', 'Success'),
 ('NROL-76', 'Success'),
 ('Boeing X-37B OTV-5', 'Success'),
 ('SES-11 / EchoStar 105', 'Success'),
 ('GovSat-1 / SES-16', 'Success'),
 ('SES-12', 'Success'),
 ('Merah Putih ', 'Success'),
 ('Es hail 2', 'Success'),
 ('SSO-A ', 'Success'),
 ('Nusantara Satu, Beresheet Moon lander, S5', 'Success'),
 ('RADARSAT Constellation, SpaceX CRS-18 ', 'Success'),
 ('GPS III-03, ANASIS-II', 'Success'),
 ('ANASIS-II, Starlink 9 v1.0', 'Success'),
 ('GPS III-04 , Crew-1', 'Success')]

### Task 7

##### List the total number of successful and failure mission outcomes

In [13]:
%%sql 
SELECT DISTINCT MISSION_OUTCOME, COUNT(*) 
FROM SPACEXTBL 
GROUP BY MISSION_OUTCOME

 * sqlite:///my_data1.db
Done.

[('Failure (in flight)', 1),
 ('Success', 98),
 ('Success ', 1),
 ('Success (payload status unclear)', 1)]

### Task 8

##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [14]:
%%sql 
SELECT DISTINCT BOOSTER_VERSION, PAYLOAD_MASS__KG_
FROM SPACEXTBL
WHERE PAYLOAD_MASS__KG_ IN
    (SELECT MAX(PAYLOAD_MASS__KG_) FROM SPACEXTBL)

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4', 15600),
 ('F9 B5 B1049.4', 15600),
 ('F9 B5 B1051.3', 15600),
 ('F9 B5 B1056.4', 15600),
 ('F9 B5 B1048.5', 15600),
 ('F9 B5 B1051.4', 15600),
 ('F9 B5 B1049.5', 15600),
 ('F9 B5 B1060.2 ', 15600),
 ('F9 B5 B1058.3 ', 15600),
 ('F9 B5 B1051.6', 15600),
 ('F9 B5 B1060.3', 15600),
 ('F9 B5 B1049.7 ', 15600)]

### Task 9

##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.**

In [15]:
%%sql
SELECT substr(Date,4,2), "Landing _Outcome", BOOSTER_VERSION, LAUNCH_SITE
FROM SPACEXTBL
WHERE "Landing _Outcome" = 'Failure (drone ship)'
    AND substr(Date,7,4) = '2015'

 * sqlite:///my_data1.db
Done.

[('01', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('04', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]

### Task 10

##### Rank the  count of  successful landing_outcomes between the date 04-06-2010 and 20-03-2017 in descending order.

In [16]:
%%sql
SELECT DATE, "Landing _Outcome", COUNT(*) AS Total,
    ROW_NUMBER() OVER(ORDER BY COUNT(*) DESC) Rank
FROM SPACEXTBL
WHERE "Landing _Outcome" LIKE '%Success%'
    AND DATE BETWEEN '04-06-2010' and '20-03-2017'
GROUP BY "Landing _Outcome"

 * sqlite:///my_data1.db
(sqlite3.OperationalError) near "(": syntax error
[SQL: SELECT DATE, "Landing _Outcome", COUNT(*) AS Total,
    ROW_NUMBER() OVER(ORDER BY COUNT(*) DESC) Rank
FROM SPACEXTBL
WHERE "Landing _Outcome" LIKE '%Success%'
    AND DATE BETWEEN '04-06-2010' and '20-03-2017'
GROUP BY "Landing _Outcome"]
(Background on this error at: http://sqlalche.me/e/e3q8)